Revit 2024 API
BuiltInFailures.RebarFailures.NoVisibleTargetsForCurrentConstraint Property
 There are no visible constraint targets in the current view. Please switch to another view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoVisibleTargetsForCurrentConstraint { get; }
Visual Basic
Public Shared ReadOnly Property NoVisibleTargetsForCurrentConstraint As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoVisibleTargetsForCurrentConstraint {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace